
"""

انواع داده در پایتون
متغیرها انواع مختلفی از داده‌ها را در خود ذخیره می‌کنند و هر کدام از آن‌ها، ویژگی‌های خاص خود را دارند.

"""

# python data types
"""

نوع داده                            	ویژگی‌ها                                    	نام کلاس

Integer	                                نگهداری اعداد صحیح به طول بی‌نهایت	            int
Float	                                نگهداری اعداد اعشاری تا 15 رقم اعشار	       float
Complex                                 نگهداری اعداد صحیح و اعشاری به صورت مختلط	  complex
String	                                نگهداری رشته‌ها، غیرقابل تغییر	                str
List	                                دنباله قابل تغییر و دارای ترتیب	               list
Tuple	                                دنباله غیرقابل تغییر و دارای ترتیب	           tuple

Dictionary	نگهداری از عناصر و داده‌ها به صورت Key:Value	()dict


"""

# تشخیص انواع داده در پایتون
x = 5
print(type(x)) # <class 'int'>
# عدد پنج، یک عدد از نوع  (عدد صحیح) است


x = ("apple", "banana", "cherry") # تاپل در پایتون

x = "Hello World!" # string or str or رشته

x = ["apple", "banana", "cherry"] # لیست ها در پایتون

x = {"name" : "John", "age" : 36} # نوع دیکشنری ها

x = True # بولی



