# متغیرها فضاهایی از حافظه هستند که می توان مقداری را به آنها اختصاص داد
# فضایی از حافظه موقت، که اطلاعات در اون بخش ذخیره می شود، متغییر گفته می شود

# قوانین تعریف متغییر 

# برای مقدار دهی به متغییر از علامت "=" استفاده می کنیم

#نحوه ساخت متغیرها  

name = "Mahdi Azimi"
print(name)

number = 123
print(number)



"""
برای تعریف چند متغییر در چند خط، می توانیم متغییر ها به ترتیب پشت سرهم قبل از علامت "=" بنویسیم،
 سپس مقادیر متناظر هر متغییر به ترتیب بعد از "=" تعریف می کنیم. 
 مقادیر و متغییر ها با علامت "," از هم جدا می شوند.
"""


A, B, C = 1, 2, 3

print(A, B, C)




"""
انواع متغیر
متغیر های عددی : integer ، float ، complex
رشته  (string)
تاپل (tuple)
لیست (مجموعه)
مجموعه (set)
دیکشنری (dictionary)
بولین (boolean)


"""




# قوانین نامگذاری متغییرها
"""
شامل حروف کوچک و بزرگ انگلیسی باشد. یعنی a تا z و A تا Z.
شامل اعداد 0 تا 9 باشد.
شامل کاراکتر آندرلاین _ باشد.
از کارکترهای خاص مانند @!#$%* و... استفاده نشود.
شامل کلمات کلیدی پایتون نباشد. (کلمات کلیدی پایتون در ادامه توضیح داده خواهد شد)
نام متغیر با عدد شروع نشود.
فاصله یا space نداشته باشد.

"""